---
description: "Project requirements and user stories"
globs: 
alwaysApply: false
---

# 要件定義ガイドライン

## 大原則
- **このルールズの意義**: このプルジェクトルールズは、単にAIへの指示という意味だけでなく、開発を進める上で今までの開発内容を確認するためのドキュメントという意味合いをもっています。

## プロジェクト概要
- **ターゲットユーザー**: Cursorエディタでプロジェクトルール図の設定を容易する
- **課題と目的**: Cursorエディタでプロジェクトルールズの設定を容易することで、Cursorエディタを使いやすくする。
- **基本コンセプト**: シンプルかつ拡張が容易で、メンテナンスが楽なツールにしたい。

## 機能要件
あらかじめ用意したテンプレート(ルールセット)をもとに、プロジェクトに簡単にプロジェクトルールズを適用できるようにする。
また、mdcファイルの記述を工夫することで、Cursor自体がmdcファイルを更新できるようにする。（Cusrorの機能）

## ルールの変更に関するガイド
- **ルール更新提案**: 開発を進めていく中で、ルールに反するような開発をおこなう可能性がでてきた場合は、および、ルールに新たな内容を付け加える必要がでてきた場合は、そのまま開発を進めないでください。この場合、ユーザーの合意を得てルールを変更してください。